app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY "messages"."id" ASC
---
    def index
        @messages = Message.all.order(:id)