app/controllers/requests_controller.rb

INSERT INTO "requests" ("title", "description", "latitude", "longitude", "category", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
      def create
        @request = Request.new(request_params)
        @request.user_id = session[:user_id]
        if @request.save