app/controllers/user_requests_controller.rb

SELECT "user_requests".* FROM "user_requests" WHERE "user_requests"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        @user_request = UserRequest.find(params[:id])